{"config": [{"config": {"function_type": "lambda", "output_shape": [40, 80, 3], "trainable": true, "name": "lambda_1", "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000S\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003N\u00e7\u0000\u0000\u0000\u0000\u0000\u00e0_@\u00e7\u0000\u0000\u0000\u0000\u0000\u0000\u00f0?\u00a9\u0000)\u0001\u00da\u0001xr\u0003\u0000\u0000\u0000r\u0003\u0000\u0000\u0000\u00fa\bmodel.py\u00da\b<lambda>k\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null], "input_dtype": "float32", "output_shape_type": "raw", "arguments": {}, "batch_input_shape": [null, 40, 80, 3]}, "class_name": "Lambda"}, {"config": {"b_regularizer": null, "W_regularizer": null, "W_constraint": null, "b_constraint": null, "name": "convolution2d_1", "activity_regularizer": null, "activation": "linear", "dim_ordering": "tf", "subsample": [1, 1], "nb_row": 1, "nb_col": 1, "border_mode": "same", "nb_filter": 1, "bias": true, "trainable": true, "init": "glorot_uniform"}, "class_name": "Convolution2D"}, {"config": {"b_regularizer": null, "W_regularizer": {"name": "L1L2Regularizer", "l1": 0.0, "l2": 0.0}, "W_constraint": null, "b_constraint": null, "name": "convolution2d_2", "activity_regularizer": null, "activation": "linear", "dim_ordering": "tf", "subsample": [1, 1], "nb_row": 5, "nb_col": 5, "border_mode": "valid", "nb_filter": 32, "bias": true, "trainable": true, "init": "glorot_uniform"}, "class_name": "Convolution2D"}, {"config": {"strides": [2, 2], "border_mode": "valid", "name": "maxpooling2d_1", "trainable": true, "pool_size": [2, 2], "dim_ordering": "tf"}, "class_name": "MaxPooling2D"}, {"config": {"name": "activation_1", "trainable": true, "activation": "elu"}, "class_name": "Activation"}, {"config": {"b_regularizer": null, "W_regularizer": {"name": "L1L2Regularizer", "l1": 0.0, "l2": 0.0}, "W_constraint": null, "b_constraint": null, "name": "convolution2d_3", "activity_regularizer": null, "activation": "linear", "dim_ordering": "tf", "subsample": [1, 1], "nb_row": 3, "nb_col": 3, "border_mode": "valid", "nb_filter": 64, "bias": true, "trainable": true, "init": "glorot_uniform"}, "class_name": "Convolution2D"}, {"config": {"strides": [2, 2], "border_mode": "valid", "name": "maxpooling2d_2", "trainable": true, "pool_size": [2, 2], "dim_ordering": "tf"}, "class_name": "MaxPooling2D"}, {"config": {"name": "activation_2", "trainable": true, "activation": "elu"}, "class_name": "Activation"}, {"config": {"name": "dropout_1", "trainable": true, "p": 0.5}, "class_name": "Dropout"}, {"config": {"b_regularizer": null, "W_regularizer": {"name": "L1L2Regularizer", "l1": 0.0, "l2": 0.0}, "W_constraint": null, "b_constraint": null, "name": "convolution2d_4", "activity_regularizer": null, "activation": "linear", "dim_ordering": "tf", "subsample": [1, 1], "nb_row": 3, "nb_col": 3, "border_mode": "valid", "nb_filter": 128, "bias": true, "trainable": true, "init": "glorot_uniform"}, "class_name": "Convolution2D"}, {"config": {"name": "activation_3", "trainable": true, "activation": "elu"}, "class_name": "Activation"}, {"config": {"name": "dropout_2", "trainable": true, "p": 0.5}, "class_name": "Dropout"}, {"config": {"name": "flatten_1", "trainable": true}, "class_name": "Flatten"}, {"config": {"b_regularizer": null, "W_regularizer": {"name": "L1L2Regularizer", "l1": 0.0, "l2": 0.0}, "W_constraint": null, "b_constraint": null, "name": "dense_1", "activity_regularizer": null, "activation": "linear", "input_dim": 12288, "bias": true, "trainable": true, "output_dim": 512, "init": "glorot_uniform"}, "class_name": "Dense"}, {"config": {"name": "activation_4", "trainable": true, "activation": "elu"}, "class_name": "Activation"}, {"config": {"name": "dropout_3", "trainable": true, "p": 0.5}, "class_name": "Dropout"}, {"config": {"b_regularizer": null, "W_regularizer": {"name": "L1L2Regularizer", "l1": 0.0, "l2": 0.0}, "W_constraint": null, "b_constraint": null, "name": "dense_2", "activity_regularizer": null, "activation": "linear", "input_dim": 512, "bias": true, "trainable": true, "output_dim": 128, "init": "glorot_uniform"}, "class_name": "Dense"}, {"config": {"name": "activation_5", "trainable": true, "activation": "elu"}, "class_name": "Activation"}, {"config": {"name": "dropout_4", "trainable": true, "p": 0.5}, "class_name": "Dropout"}, {"config": {"b_regularizer": null, "W_regularizer": {"name": "L1L2Regularizer", "l1": 0.0, "l2": 0.0}, "W_constraint": null, "b_constraint": null, "name": "dense_3", "activity_regularizer": null, "activation": "linear", "input_dim": 128, "bias": true, "trainable": true, "output_dim": 32, "init": "glorot_uniform"}, "class_name": "Dense"}, {"config": {"name": "activation_6", "trainable": true, "activation": "elu"}, "class_name": "Activation"}, {"config": {"name": "dropout_5", "trainable": true, "p": 0.5}, "class_name": "Dropout"}, {"config": {"b_regularizer": null, "W_regularizer": null, "W_constraint": null, "b_constraint": null, "name": "dense_4", "activity_regularizer": null, "activation": "linear", "input_dim": 32, "bias": true, "trainable": true, "output_dim": 1, "init": "glorot_uniform"}, "class_name": "Dense"}], "keras_version": "1.2.1", "class_name": "Sequential"}