{"class_name": "Sequential", "keras_version": "1.2.1", "config": [{"class_name": "Lambda", "config": {"output_shape": [40, 80, 3], "input_dtype": "float32", "batch_input_shape": [null, 40, 80, 3], "name": "lambda_1", "arguments": {}, "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000S\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003N\u00e7\u0000\u0000\u0000\u0000\u0000\u00e0_@\u00e7\u0000\u0000\u0000\u0000\u0000\u0000\u00f0?\u00a9\u0000)\u0001\u00da\u0001xr\u0003\u0000\u0000\u0000r\u0003\u0000\u0000\u0000\u00fa\bmodel.py\u00da\b<lambda>\u0088\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null], "function_type": "lambda", "trainable": true, "output_shape_type": "raw"}}, {"class_name": "Convolution2D", "config": {"nb_filter": 3, "b_constraint": null, "activity_regularizer": null, "trainable": true, "init": "glorot_uniform", "subsample": [1, 1], "W_regularizer": null, "nb_col": 1, "activation": "linear", "name": "convolution2d_1", "border_mode": "same", "bias": true, "b_regularizer": null, "dim_ordering": "tf", "nb_row": 1, "W_constraint": null}}, {"class_name": "Convolution2D", "config": {"nb_filter": 32, "b_constraint": null, "activity_regularizer": null, "trainable": true, "init": "glorot_uniform", "subsample": [1, 1], "W_regularizer": {"name": "L1L2Regularizer", "l2": 0.0, "l1": 0.0}, "nb_col": 5, "activation": "linear", "name": "convolution2d_2", "border_mode": "valid", "bias": true, "b_regularizer": null, "dim_ordering": "tf", "nb_row": 5, "W_constraint": null}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "elu", "name": "activation_1"}}, {"class_name": "Convolution2D", "config": {"nb_filter": 32, "b_constraint": null, "activity_regularizer": null, "trainable": true, "init": "glorot_uniform", "subsample": [1, 1], "W_regularizer": {"name": "L1L2Regularizer", "l2": 0.0, "l1": 0.0}, "nb_col": 5, "activation": "linear", "name": "convolution2d_3", "border_mode": "valid", "bias": true, "b_regularizer": null, "dim_ordering": "tf", "nb_row": 5, "W_constraint": null}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "elu", "name": "activation_2"}}, {"class_name": "MaxPooling2D", "config": {"pool_size": [2, 2], "strides": [2, 2], "name": "maxpooling2d_1", "border_mode": "valid", "trainable": true, "dim_ordering": "tf"}}, {"class_name": "Convolution2D", "config": {"nb_filter": 64, "b_constraint": null, "activity_regularizer": null, "trainable": true, "init": "glorot_uniform", "subsample": [1, 1], "W_regularizer": {"name": "L1L2Regularizer", "l2": 0.0, "l1": 0.0}, "nb_col": 3, "activation": "linear", "name": "convolution2d_4", "border_mode": "valid", "bias": true, "b_regularizer": null, "dim_ordering": "tf", "nb_row": 3, "W_constraint": null}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "elu", "name": "activation_3"}}, {"class_name": "Convolution2D", "config": {"nb_filter": 64, "b_constraint": null, "activity_regularizer": null, "trainable": true, "init": "glorot_uniform", "subsample": [1, 1], "W_regularizer": {"name": "L1L2Regularizer", "l2": 0.0, "l1": 0.0}, "nb_col": 3, "activation": "linear", "name": "convolution2d_5", "border_mode": "valid", "bias": true, "b_regularizer": null, "dim_ordering": "tf", "nb_row": 3, "W_constraint": null}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "elu", "name": "activation_4"}}, {"class_name": "MaxPooling2D", "config": {"pool_size": [2, 2], "strides": [2, 2], "name": "maxpooling2d_2", "border_mode": "valid", "trainable": true, "dim_ordering": "tf"}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_1", "p": 0.5}}, {"class_name": "Convolution2D", "config": {"nb_filter": 128, "b_constraint": null, "activity_regularizer": null, "trainable": true, "init": "glorot_uniform", "subsample": [1, 1], "W_regularizer": {"name": "L1L2Regularizer", "l2": 0.0, "l1": 0.0}, "nb_col": 3, "activation": "linear", "name": "convolution2d_6", "border_mode": "valid", "bias": true, "b_regularizer": null, "dim_ordering": "tf", "nb_row": 3, "W_constraint": null}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "elu", "name": "activation_5"}}, {"class_name": "Convolution2D", "config": {"nb_filter": 128, "b_constraint": null, "activity_regularizer": null, "trainable": true, "init": "glorot_uniform", "subsample": [1, 1], "W_regularizer": {"name": "L1L2Regularizer", "l2": 0.0, "l1": 0.0}, "nb_col": 3, "activation": "linear", "name": "convolution2d_7", "border_mode": "valid", "bias": true, "b_regularizer": null, "dim_ordering": "tf", "nb_row": 3, "W_constraint": null}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "elu", "name": "activation_6"}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_2", "p": 0.5}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"output_dim": 128, "b_constraint": null, "input_dim": 3072, "activity_regularizer": null, "trainable": true, "init": "glorot_uniform", "W_regularizer": {"name": "L1L2Regularizer", "l2": 0.0, "l1": 0.0}, "activation": "linear", "name": "dense_1", "bias": true, "b_regularizer": null, "W_constraint": null}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "elu", "name": "activation_7"}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_3", "p": 0.5}}, {"class_name": "Dense", "config": {"output_dim": 64, "b_constraint": null, "input_dim": 128, "activity_regularizer": null, "trainable": true, "init": "glorot_uniform", "W_regularizer": {"name": "L1L2Regularizer", "l2": 0.0, "l1": 0.0}, "activation": "linear", "name": "dense_2", "bias": true, "b_regularizer": null, "W_constraint": null}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "elu", "name": "activation_8"}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_4", "p": 0.5}}, {"class_name": "Dense", "config": {"output_dim": 16, "b_constraint": null, "input_dim": 64, "activity_regularizer": null, "trainable": true, "init": "glorot_uniform", "W_regularizer": {"name": "L1L2Regularizer", "l2": 0.0, "l1": 0.0}, "activation": "linear", "name": "dense_3", "bias": true, "b_regularizer": null, "W_constraint": null}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "elu", "name": "activation_9"}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_5", "p": 0.5}}, {"class_name": "Dense", "config": {"output_dim": 1, "b_constraint": null, "input_dim": 16, "activity_regularizer": null, "trainable": true, "init": "glorot_uniform", "W_regularizer": null, "activation": "linear", "name": "dense_4", "bias": true, "b_regularizer": null, "W_constraint": null}}]}